lectures/w11d5-middleware/demo/app/controllers/api/teas_controller.rb

INSERT INTO "teas" ("flavor", "price", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["flavor", "blue"], ["price", 25.45], ["description", "very hard to find"], ["created_at", "2023-04-14 17:52:03.784299"], ["updated_at", "2023-04-14 17:52:03.784299"]]
---
    def create
        @tea = Tea.new(tea_params)
        if @tea.save