lectures/w12d2-fullstack-auth/teatime/app/controllers/api/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest", "session_token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "hahaoops"], ["created_at", "2023-06-13 19:16:38.216141"], ["updated_at", "2023-06-13 19:16:38.216141"], ["password_digest", "[FILTERED]"], ["session_token", "[FILTERED]"]]