lectures/w12d2-fullstack-auth/TeaTime/app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest", "session_token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "mike"], ["created_at", "2023-10-03 20:42:15.349736"], ["updated_at", "2023-10-03 20:42:15.349736"], ["password_digest", "[FILTERED]"], ["session_token", "[FILTERED]"]]
---
  def create
    @user = User.new(user_params)
    if @user.save # check validations, save to db