lectures/w10d5-thunk-middleware/JollyTeaShop/app/controllers/api/teas_controller.rb

SELECT "teas".* FROM "teas"
---
  def index
    teas = Tea.all

INSERT INTO "teas" ("flavor", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["flavor", "black "], ["amount", 2.05], ["created_at", "2020-08-07 18:45:57.634216"], ["updated_at", "2020-08-07 18:45:57.634216"]]
---
  def create
    # debugger
    tea = Tea.new(tea_params)

    if tea.save