lectures/w11d5-middleware/tea-shop/app/controllers/api/teas_controller.rb

  def index
    debugger
    @teas = Tea.all
---
SELECT "teas".* FROM "teas"

  def create
    debugger
    @tea = Tea.new(tea_params)
    if @tea.save
---
INSERT INTO "teas" ("flavor", "price", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["flavor", "shan"], ["price", 6.0], ["description", nil], ["created_at", "2023-06-09 19:01:54.678102"], ["updated_at", "2023-06-09 19:01:54.678102"]]