lectures/w11d4-thunk-middleware/TeaTime/app/controllers/api/teas_controller.rb

    def index
        teas = Tea.all
---
SELECT "teas".* FROM "teas"

    def create # adds a tea to the teas table in database
        tea = Tea.new(tea_params)
        debugger;
        if tea.save
---
INSERT INTO "teas" ("flavor", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["flavor", "Spicy Watermelon"], ["amount", 5.0], ["created_at", "2022-03-10 19:23:36.452210"], ["updated_at", "2022-03-10 19:23:36.452210"]]