lectures/w7d1-user-auth/DogeBird/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "taylormade"], ["LIMIT", 1]]
---
    def self.find_by_credentials(username, password)
        # find a user by their username
        user = User.find_by(username: username)