Troll/app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets" WHERE "tweets"."author_id" = $1  [["author_id", 13]]
---
  def index
    tweets = Tweet.where(author_id: params[:user_id])