Troll/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save #runs user.save. If true, then:
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "age", "password_digest", "session_token") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    user = User.find(params[:id])

    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "age" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "jacked_john"], ["age", 74], ["updated_at", "2021-10-08 18:58:17.375388"], ["id", 3]]