lectures/w12d2-frontend-auth/TeaTimeStart/app/controllers/api/teas_controller.rb

  def index
    @teas = Tea.all
---
SELECT "teas".* FROM "teas"

  def show
    @tea = Tea.find_by(id: params[:id])
---
SELECT "teas".* FROM "teas" WHERE "teas"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def create
    # debugger
    @tea = Tea.new(tea_params)
    if @tea.save # remember no bang
---
INSERT INTO "teas" ("flavor", "price", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["flavor", "the best tea"], ["price", 999999999.0], ["description", "simply the best"], ["created_at", "2022-10-25 21:14:58.563089"], ["updated_at", "2022-10-25 21:14:58.563089"]]