lectures/w12d2-fullstack-auth/teatime_start/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "kristin"], ["LIMIT", 1]]
---
    def self.find_by_credentials(username, password)
      user = User.find_by_username(username)

SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
    def generate_session_token
      while true
        token = SecureRandom.urlsafe_base64
        return token unless User.exists?(session_token: token)

UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-02-21 22:27:26.881879"], ["session_token", "[FILTERED]"], ["id", 9]]
---
    def reset_session_token!
      self.session_token = generate_session_token
      self.save!