lectures/w12d2-fullstack-auth/teatime_start/app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest", "session_token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "kristin"], ["created_at", "2023-02-21 22:27:26.730759"], ["updated_at", "2023-02-21 22:27:26.730759"], ["password_digest", "[FILTERED]"], ["session_token", "[FILTERED]"]]
---
    def create
        @user = User.new(user_params)
        if @user.save