lectures/w7d1-Auth/BlueBird/app/controllers/application_controller.rb

    def current_user
        # find user by session token and return them
        @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "a-JkawMWxLi_zW4z52wBpQ"], ["LIMIT", 1]]