lectures/w7d1-Auth/BlueBird/app/controllers/users_controller.rb

    def create
        # debugger
        @user = User.new(user_params)

        if @user.save
---
INSERT INTO "users" ("username", "email", "coding_pref", "age", "password_digest", "session_token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def update
        @user = User.find_by(id: params[:id])
        debugger
        if @user && @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "coding_pref" = $1 WHERE "users"."id" = $2  [["coding_pref", "javascript"], ["id", 1]]