lectures/w7d1-rails-auth/blue_bird/app/controllers/application_controller.rb

    def current_user
        # if someone is logged in we will find them by their session token
        @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "nwtIpsOwfuEPkqjUHuXT8Q"], ["LIMIT", 1]]