lectures/w13d5-FSP-jbuilder-and-more/TeaTime/app/views/api/teas/index.json.jbuilder

SELECT "likes".* FROM "likes" WHERE "likes"."tea_id" IN ($1, $2, $3, $4)  [["tea_id", 1], ["tea_id", 2], ["tea_id", 3], ["tea_id", 4]]
---
teas = @teas.includes(:likes)

SELECT "likes".* FROM "likes" WHERE "likes"."tea_id" = $1  [["tea_id", 1]]
---
        json.extract! tea, :flavor, :price, :id
        json.num_likes tea.likes.length