demos/BlueBird/app/models/user.rb

    def reset_session_token!  # mutates
        self.session_token = SecureRandom::urlsafe_base64
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "VsFF_1mINAERpumtOOIJUA"], ["updated_at", "2019-08-05 15:08:11.386551"], ["id", 3]]