lectures/w09d3-ajax/backend/app/controllers/api/gifs_controller.rb

  def create
    @gif = Gif.new(gif_params)
    if @gif.save
---
INSERT INTO "gifs" ("title", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"