lectures/w9d3-ajax/demo/app/controllers/gifs_controller.rb

INSERT INTO "gifs" ("title", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "pretend"], ["url", "www.pretendurl.com"], ["created_at", "2022-08-10 17:18:08.405805"], ["updated_at", "2022-08-10 17:18:08.405805"]]
---
  def create
    gif = Gif.new(gif_params)
    if gif.save

SELECT "gifs".* FROM "gifs" WHERE "gifs"."title" = $1 LIMIT $2  [["title", "test"], ["LIMIT", 1]]
---
  def show
    gif = Gif.find_by(title: params[:title])