lectures/w12d2-fullstack-auth/teatime_start/app/views/api/teas/show.json.jbuilder

SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3)  [["id", 2], ["id", 3], ["id", 4]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."tea_id" = $1  [["tea_id", 3]]
---
# if we, instead, just iterated over tea.transactions, we would have an N+1 query
transactions = @tea.transactions.includes(:user)