demos/ShirtShop_with_Lina/app/views/api/shirts/show.json.jbuilder

json.reviews do
    @shirt.reviews.each do |review|
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."shirt_id" = $1  [["shirt_id", 1]]