lectures/DogeBird/app/controllers/chirps_controller.rb

SELECT "chirps".* FROM "chirps"
---
  def index
    # debugger
    @chirps = Chirp.all

SELECT "chirps".* FROM "chirps" WHERE "chirps"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    # debugger
    @chirp = Chirp.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "chirps" ("body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "hello world"], ["author_id", 1], ["created_at", "2023-01-11 21:51:43.826799"], ["updated_at", "2023-01-11 21:51:43.826799"]]
---
  def create
    # debugger
    @chirp = Chirp.new(chirp_params)
    @chirp.user = User.first #this would be current user, but we don't have a session yet
    if @chirp.save #

SELECT "chirps".* FROM "chirps" WHERE "chirps"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "chirps" WHERE "chirps"."id" = $1  [["id", 3]]
---
  def destroy
    @chirp = Chirp.find(params[:id])
    @chirp.destroy

SELECT "chirps".* FROM "chirps" WHERE "chirps"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "chirps" SET "body" = $1, "updated_at" = $2 WHERE "chirps"."id" = $3  [["body", "maybe if we don't restrict speech on here elon will buy us"], ["updated_at", "2023-01-11 20:06:18.390451"], ["id", 1]]
---
  def update
    @chirp = Chirp.find(params[:id])

    if @chirp.update(chirp_params)