lectures/DogeBird/app/controllers/users_controller.rb

  def create
    # debugger
    user = User.new(user_params)

    if user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "favorite_coin", "age", "password_digest", "session_token") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    user = User.find_by(id: params[:id])

    if user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "edited user"], ["updated_at", "2023-01-13 20:11:47.310344"], ["id", 12]]