lectures/w12d1-class-components/teatime/app/controllers/api/teas_controller.rb

  def index
    @teas = Tea.all
---
SELECT "teas".* FROM "teas"

  def show
    @tea = Tea.find(params[:id])
---
SELECT "teas".* FROM "teas" WHERE "teas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    # debugger
    @tea = Tea.new(tea_params)
    if @tea.save # remember no bang
---
INSERT INTO "teas" ("flavor", "price", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["flavor", "Black"], ["price", 4.5], ["description", nil], ["created_at", "2022-08-25 22:19:34.070282"], ["updated_at", "2022-08-25 22:19:34.070282"]]

  def destroy
    @tea = Tea.find_by(id: params[:id])
    if @tea.destroy
---
SELECT "teas".* FROM "teas" WHERE "teas"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "teas" WHERE "teas"."id" = $1  [["id", 10]]