lectures/w12d1-jbuilder/demo/app/controllers/api/teas_controller.rb

  def show
    @tea = Tea.find(params[:id])
---
SELECT "teas".* FROM "teas" WHERE "teas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    # debugger
    @tea = Tea.new(tea_params) # doesn't have to be @tea for now, no views
    if @tea.save
---
INSERT INTO "teas" ("flavor", "price", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["flavor", "jasmine"], ["price", 7.0], ["description", nil], ["created_at", "2023-04-17 16:36:22.949399"], ["updated_at", "2023-04-17 16:36:22.949399"]]