assessment_tips/rails_2/rails_2_buggy_version/app/views/users/show.html.erb

SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = $1  [["user_id", 123]]
---
<h2>goals for <%= @user.username %></h2>
<% @user.goals.each do |goal| %>