lectures/w6d5-rails-views/blue_bird/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "created_at", "updated_at", "coding_affiliation", "age") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", "banana"], ["email", "banana@gmail.com"], ["created_at", "2022-02-04 19:16:15.820021"], ["updated_at", "2022-02-04 19:16:15.820021"], ["coding_affiliation", "Ruby"], ["age", 25]]
---
    def create
        @user = User.new(user_params)

        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "age" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["age", 50], ["updated_at", "2022-02-04 19:32:05.385559"], ["id", 1]]
---
    def update
        @user = User.find(params[:id])
        if @user.update(user_params)