lectures/w12d2-fullstack-auth/tea-shop-auth/app/views/api/teas/show.json.jbuilder

SELECT "transactions".* FROM "transactions" WHERE "transactions"."tea_id" = $1  [["tea_id", 1]]
---
json.transactions do
    @tea.transactions.each do |transaction|