demos/ShirtShop_with_Lina/app/controllers/api/shirts_controller.rb

  def index
    # debugger
    @shirts = Shirt.all
---
SELECT "shirts".* FROM "shirts"

  def create
    # debugger
    @shirt = Shirt.new(shirt_params)

    if @shirt.save
---
INSERT INTO "shirts" ("style", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["style", "sdf"], ["price", 0.0], ["created_at", "2020-06-14 18:09:17.002326"], ["updated_at", "2020-06-14 18:09:17.002326"]]

  def show
    @shirt = Shirt.find(params[:id])
---
SELECT  "shirts".* FROM "shirts" WHERE "shirts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]