lectures/w7d3-rails-testing/demo_practice/app/controllers/chirps_controller.rb

    def index
        if params[:user_id]
          @chirps = Chirp.where(author_id: params[:user_id]).includes(:author)
        else
          @chirps = Chirp.all.includes(:author)
---
SELECT "chirps".* FROM "chirps" WHERE "chirps"."author_id" = $1  [["author_id", 10]]
SELECT "chirps".* FROM "chirps"

    def create
        @chirp = Chirp.new(chirp_params)
        @chirp.author = current_user
        if @chirp.save
---
INSERT INTO "chirps" ("body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "Chirps are great!"], ["author_id", 10], ["created_at", "2022-07-26 03:55:27.562232"], ["updated_at", "2022-07-26 03:55:27.562232"]]

    def destroy
        @chirp = Chirp.find(params[:id])
        @chirp.destroy
---
SELECT "chirps".* FROM "chirps" WHERE "chirps"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "chirps" WHERE "chirps"."id" = $1  [["id", 12]]