lectures/w12d2-fullstack-auth/TeaTime/app/models/user.rb

    def reset_session_token!
        self.session_token = generate_session_token
        self.save!
---
UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-10-03 20:42:15.371792"], ["session_token", "[FILTERED]"], ["id", 9]]

    def generate_session_token
        while true
            token = SecureRandom.urlsafe_base64
            return token unless User.exists?(session_token: token)
---
SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]