lectures/w12d2-fullstack-auth/teatime/app/models/user.rb

UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-06-13 19:16:38.229854"], ["session_token", "[FILTERED]"], ["id", 10]]
---
    def reset_session_token!
      self.session_token = generate_unique_session_token
      self.save!