lectures/w12d2-front-end-auth/tea_shop/app/models/user.rb

SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
    def generate_unique_session_token
      while true
        token = SecureRandom::urlsafe_base64
        return token unless User.exists?(session_token: token)