lectures/w6d3-routes-controllers/blue_bird/app/controllers/chirps_controller.rb

SELECT "chirps".* FROM "chirps" WHERE "chirps"."author_id" = $1  [["author_id", 1]]
---
    def index
        chirps = Chirp.where(author_id: params[:user_id])