lectures/w9d4-ajax/demo/giphy-demo/app/controllers/gifs_controller.rb

  def create
    gif = Gif.new(gif_params)
    debugger
    if gif.save
---
INSERT INTO "gifs" ("title", "url") VALUES ($1, $2) RETURNING "id"  [["title", "test1"], ["url", "https://media0.giphy.com/media/4WFPy8gcqpm9xQlA1J/giphy.gif"]]

  def show
    gif = Gif.find_by(title: params[:title])
---
SELECT  "gifs".* FROM "gifs" WHERE "gifs"."title" = $1 LIMIT $2  [["title", "scrubber"], ["LIMIT", 1]]