lectures/w13d5-FSP-jbuilder-and-more/TeaTime/app/controllers/api/teas_controller.rb

SELECT "teas".* FROM "teas"
---
    def index
        # debugger
        @teas = Tea.all

INSERT INTO "teas" ("flavor", "price", "description", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["flavor", "reali"], ["price", 100.0], ["description", nil], ["amount", nil], ["created_at", "2023-09-29 19:09:19.667883"], ["updated_at", "2023-09-29 19:09:19.667883"]]
---
    def create
        # debugger
        @tea = Tea.new(tea_params)
        if @tea.save

SELECT "teas".* FROM "teas" WHERE "teas"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3)  [["id", 2], ["id", 3], ["id", 4]]
---
    def show
        # debugger
        @tea = Tea.includes(transactions: :user).find_by(id: params[:id]) #transactions is an association being called on @tea and user is an association called on each trasaction.  Using includes will help avoid an n+1 query