lectures/w13d5-FSP-jbuilder-and-more/TeaTime/app/controllers/api/transactions_controller.rb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."tea_id" = $1  [["tea_id", 1]]
---
  def index
    @transactions = Transaction.where(tea_id: params[:tea_id])