assessment_tips/rails_2/rails_2_buggy_version/app/controllers/goals_controller.rb

  def create
    @goal = Goal.new(goal_params)
    if @goal.save!
---
INSERT INTO "goals" ("name", "details", "status", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Exercise"], ["details", "do it"], ["status", true], ["user_id", 75], ["created_at", "2023-09-01 00:22:28.390902"], ["updated_at", "2023-09-01 00:22:28.390902"]]

  def destroy
    @goal = current_user.goals.find_by(id: params[:id])
        if @goal && @goal.delete
---
SELECT "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "goals" WHERE "goals"."id" = $1  [["id", 6]]