assessment_tips/rails_2/rails_2_buggy_version/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "session_token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "jack_bruce"], ["session_token", "[FILTERED]"], ["password_digest", "[FILTERED]"], ["created_at", "2023-08-31 23:55:57.560738"], ["updated_at", "2023-08-31 23:55:57.560738"]]
---
  def create
    @user = User.new(user_params)
    if @user.save!