lectures/W11D3-Middleware/TeaTime/app/controllers/api/teas_controller.rb

    def index
        teas = Tea.all
---
SELECT "teas".* FROM "teas"

    def create
        tea = Tea.new(tea_params)
        debugger
        if tea.save
---
INSERT INTO "teas" ("flavor", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["flavor", "Chai"], ["amount", 4.5], ["created_at", "2022-01-12 18:35:35.453531"], ["updated_at", "2022-01-12 18:35:35.453531"]]