demos/w9d4-ajax/AjaxLecture_solution/app/controllers/gifs_controller.rb

INSERT INTO "gifs" ("title", "url") VALUES ($1, $2) RETURNING "id"  [["title", "funny"], ["url", "https://media1.giphy.com/media/S5K41EMH0S75Cr7wge/giphy.gif"]]
---
  def create
    gif = Gif.new(gif_params)
    if gif.save

SELECT  "gifs".* FROM "gifs" WHERE "gifs"."title" = $1 LIMIT $2  [["title", "drone"], ["LIMIT", 1]]
---
  def show
    gif = Gif.find_by(title: params[:title])