lectures/w11d2-jbuilder/TeaTime/app/views/api/teas/show.json.jbuilder

SELECT "transactions".* FROM "transactions" WHERE "transactions"."tea_id" = $1  [["tea_id", 5]]
---
json.transactions do
  @tea.transactions.each do |transaction|