lectures/w11d5-middleware/TeaTime/app/views/api/teas/index.json.jbuilder

SELECT "likes".* FROM "likes" WHERE "likes"."tea_id" = $1  [["tea_id", 1]]
---
teas = @teas.includes(:likes)

SELECT "likes".* FROM "likes" WHERE "likes"."tea_id" = $1  [["tea_id", 1]]
---
        # json.price tea.price
        json.num_likes tea.likes.length