lectures/w11d5-middleware/TeaTime/app/views/api/teas/show.json.jbuilder

json.transactions do
    @tea.transactions.each do |transaction|
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."tea_id" = $1  [["tea_id", 1]]


likes = @tea.likes.includes(:user)
---
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3, $4)  [["id", 3], ["id", 2], ["id", 4], ["id", 5]]
SELECT "likes".* FROM "likes" WHERE "likes"."tea_id" = $1  [["tea_id", 1]]