Troll/app/models/user.rb

  def reset_session_token!
    self.session_token = SecureRandom::urlsafe_base64
    self.save!
---
UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2021-10-11 21:03:11.131772"], ["session_token", "SIJm1gnIv4FRwUqRXDjPgA"], ["id", 13]]