demos/w10d5-Middleware/TeaApp/app/controllers/api/teas_controller.rb

    def index
        teas = Tea.all
---
SELECT "teas".* FROM "teas"

    def create
        tea = Tea.new(tea_params)

        if tea.save
---
INSERT INTO "teas" ("flavor", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["flavor", "new"], ["description", "tea"], ["created_at", "2020-02-21 19:31:29.332091"], ["updated_at", "2020-02-21 19:31:29.332091"]]