lectures/w12d2-frontend-auth/teatime/app/controllers/api/teas_controller.rb

SELECT "teas".* FROM "teas"
---
  def index
    @teas = Tea.all

SELECT "teas".* FROM "teas" WHERE "teas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @tea = Tea.find(params[:id])

INSERT INTO "teas" ("flavor", "price", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["flavor", "Yellow"], ["price", 2.34], ["description", "5"], ["created_at", "2022-08-30 18:46:36.237987"], ["updated_at", "2022-08-30 18:46:36.237987"]]
---
  def create
    # debugger
    @tea = Tea.new(tea_params)
    if @tea.save # remember no bang