lectures/w12d2-frontend-auth/teatime/app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest", "session_token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "bobo"], ["created_at", "2022-08-30 18:18:37.355858"], ["updated_at", "2022-08-30 18:18:37.355858"], ["password_digest", "[FILTERED]"], ["session_token", "[FILTERED]"]]
---
  def create
    @user = User.new(user_params)
    if @user.save