AIBird/app/controllers/chirps_controller.rb

    def index
        # debugger
        @chirps = Chirp.where(user_id: params[:user_id])
---
SELECT "chirps".* FROM "chirps" WHERE "chirps"."user_id" = $1  [["user_id", 1]]

    def create
        # debugger
        @chirp = Chirp.new(chirp_params)
        if @chirp.save
---
INSERT INTO "chirps" ("body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "AI machine does chirp chirp!"], ["user_id", 1], ["created_at", "2023-05-24 18:23:34.714012"], ["updated_at", "2023-05-24 18:23:34.714012"]]

    def show
        debugger
        @chirp = Chirp.find(params[:id])
---
SELECT "chirps".* FROM "chirps" WHERE "chirps"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def update
        @chirp = Chirp.find(params[:id])
        if @chirp.update(chirp_params)
---
SELECT "chirps".* FROM "chirps" WHERE "chirps"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "chirps" SET "body" = $1, "updated_at" = $2 WHERE "chirps"."id" = $3  [["body", "BEST UPDATED CHIRP"], ["updated_at", "2023-05-03 20:38:55.271515"], ["id", 13]]