AIBird/app/controllers/users_controller.rb

UPDATE "users" SET "updated_at" = $1, "evil_score" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-05-05 18:55:53.121439"], ["evil_score", 4], ["id", 4]]
---
    def update
        @user = User.find(params[:id])
        if @user.update(user_params)