AIBird/app/controllers/users_controller.rb

    def index
        # debugger
        @users = User.all
---
SELECT "users".* FROM "users"

    def show
        # debugger
        @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def create
        # debugger
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "evil_score", "affiliation") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", "test1"], ["email", "test1@test.com"], ["created_at", "2023-05-03 18:28:49.645108"], ["updated_at", "2023-05-03 18:28:49.645108"], ["evil_score", 10], ["affiliation", "cyborg"]]