lectures/w12d2-fullstack-auth/tea-shop-auth/app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest", "session_token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "toula"], ["created_at", "2023-08-08 19:12:05.720059"], ["updated_at", "2023-08-08 19:12:05.720059"], ["password_digest", "[FILTERED]"], ["session_token", "[FILTERED]"]]
---
  def create
    @user = User.new(user_params)
    if @user.save