lectures/w7d2-errors_csrf/blue_bird/app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save!
---
UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-02-08 17:06:37.523750"], ["session_token", "nwtIpsOwfuEPkqjUHuXT8Q"], ["id", 7]]