lectures/w11d2-jbuilder/TeaTime/app/controllers/api/teas_controller.rb

SELECT  "teas".* FROM "teas" WHERE "teas"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    @tea = Tea.find_by(id: params[:id])

INSERT INTO "teas" ("flavor", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["flavor", "blue"], ["amount", 4.5], ["created_at", "2021-03-29 18:03:24.923583"], ["updated_at", "2021-03-29 18:03:24.923583"]]
---
  def create
    @tea = Tea.new(tea_params)

    if @tea.save