lectures/w7d1-Auth/BlueBird/app/models/user.rb

    def reset_session_token!
        # we generrate a new token and save it to the user
        self.session_token = SecureRandom::urlsafe_base64
        self.save!
---
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "B7zH1DuzKfWuYhAYOp2oGA"], ["id", 1]]