lectures/w11d4-thunk/TeaTime/app/controllers/api/teas_controller.rb

  def index
    teas = Tea.all
---
SELECT "teas".* FROM "teas"

  def create
    debugger
    tea = Tea.new(tea_params)
    if tea.save
---
INSERT INTO "teas" ("flavor", "price", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["flavor", "royal"], ["price", 999999999999.0], ["description", nil], ["created_at", "2022-10-20 20:44:14.288721"], ["updated_at", "2022-10-20 20:44:14.288721"]]