AIBird/app/models/user.rb

UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-05-08 20:58:07.313851"], ["session_token", "[FILTERED]"], ["id", 8]]
---
    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save! # fail loudly