lectures/w12d2-fullstack-auth/teatime/app/views/api/teas/show.json.jbuilder


transactions = @tea.transactions.includes(:user)
---
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3)  [["id", 2], ["id", 3], ["id", 4]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."tea_id" = $1  [["tea_id", 5]]