lectures/w11d4-jbuilder/TeaTime/app/controllers/api/teas_controller.rb

INSERT INTO "teas" ("flavor", "price", "description", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["flavor", "herbal"], ["price", 7000.0], ["description", nil], ["amount", nil], ["created_at", "2023-08-03 17:44:12.280260"], ["updated_at", "2023-08-03 17:44:12.280260"]]
---
    def create
        @tea = Tea.new(tea_params)
        if @tea.save

SELECT "teas".* FROM "teas" WHERE "teas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3)  [["id", 2], ["id", 3], ["id", 4]]
---
    def show
        @tea = Tea.includes(transactions: :user).find_by(id: params[:id]) #transactions is an association being called on @tea and user is an association called on each trasaction.  Using includes will help avoid an n+1 query