lectures/w12d1-jbuilder/teatime/app/views/api/teas/show.json.jbuilder

json.transactions do
    @tea.transactions.each do |transaction|
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."tea_id" = $1  [["tea_id", 5]]