lectures/w09d3-ajax/giphy/app/controllers/api/gifs_controller.rb

INSERT INTO "gifs" ("title", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test"], ["url", "www.google.com"], ["created_at", "2023-03-29 18:52:23.005271"], ["updated_at", "2023-03-29 18:52:23.005271"]]
---
  def create
    gif = Gif.new(gif_params)
    if gif.save