lectures/DogeBird/app/models/user.rb

  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64
    self.save!
---
UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-09-19 21:16:49.023305"], ["session_token", "[FILTERED]"], ["id", 14]]