lectures/w11d1-thunk-middleware/TeaTime/app/controllers/api/teas_controller.rb

  def index
    @teas = Tea.all
---
SELECT "teas".* FROM "teas"

  def create
    tea = Tea.new(tea_params) #doesn't have to be @tea. no more views
    if tea.save
---
INSERT INTO "teas" ("flavor", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["flavor", "chamomile"], ["amount", 10.0], ["created_at", "2021-02-01 18:35:55.825202"], ["updated_at", "2021-02-01 18:35:55.825202"]]