lectures/w11d4-jbuilder/TeaTime/app/views/api/teas/show.json.jbuilder

json.transactions do
    @tea.transactions.each do |transaction|
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."tea_id" = $1  [["tea_id", 1]]