demos/BlueBird/app/controllers/chirps_controller.rb

  def index
    chirps = Chirp.where(author_id: params[:user_id])
---
SELECT "chirps".* FROM "chirps" WHERE "chirps"."author_id" = $1  [["author_id", 1]]

  def show
    chirp = Chirp.find(params[:id])
---
SELECT  "chirps".* FROM "chirps" WHERE "chirps"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]