demos/BlueBird/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at", "email", "political_affiliation", "age", "session_token", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"