lectures/w6d3/DogeBird/app/controllers/users_controller.rb

    def show

        incoming_id = params[:id]
        @user = User.find_by(id: incoming_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        debugger
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "age", "favorite_coin") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", "Taylor swift"], ["email", "taytay.com"], ["created_at", "2022-07-20 19:05:31.882284"], ["updated_at", "2022-07-20 19:05:31.882284"], ["age", 32], ["favorite_coin", "Bitcoin"]]

    def update
        @user = User.find_by(id: params[:id])
        if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "age" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-07-20 19:10:01.328448"], ["age", 11], ["id", 9]]