demos/w9d4-AJAXDemo/AjaxGiphy_demo/app/controllers/gifs_controller.rb

  def create
    gif = Gif.new(gif_params)
    if gif.save
---
INSERT INTO "gifs" ("title", "url") VALUES ($1, $2) RETURNING "id"  [["title", "slinky"], ["url", "https://media3.giphy.com/media/1Y6RKKShF9IdGyWJ1J/giphy.gif"]]

  def show
    gif = Gif.find_by(title: params[:title])
---
SELECT  "gifs".* FROM "gifs" WHERE "gifs"."title" = $1 LIMIT $2  [["title", "slinky"], ["LIMIT", 1]]