lectures/w11d4-thunk-middleware/demo/teatime/app/controllers/api/teas_controller.rb

  def create
    @tea = Tea.new(tea_params)
    if @tea.save
---
INSERT INTO "teas" ("flavor", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["flavor", "Chai"], ["amount", 7.0], ["created_at", "2021-07-22 17:31:15.985896"], ["updated_at", "2021-07-22 17:31:15.985896"]]