lectures/w7d2-flash-csrf/DogeBird/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
    def current_user
        # We use the session[:session_token] to find our user
        # We conditionally assign the @current_user ivar to avoid
        # querying the database more than once
        @current_user ||= User.find_by(session_token: session[:session_token])