lectures/w12d2-front-end-auth/tea_shop/app/controllers/api/teas_controller.rb

INSERT INTO "teas" ("flavor", "price", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["flavor", "black"], ["price", 3.0], ["description", nil], ["created_at", "2023-04-18 21:45:27.336706"], ["updated_at", "2023-04-18 21:45:27.336706"]]
---
        def create
          @tea = Tea.new(tea_params)
          if @tea.save # remember no bang