lectures/w11d5-jbuilder/TeaTime/app/controllers/api/teas_controller.rb

  def index
    teas = Tea.all
---
SELECT "teas".* FROM "teas"

  def create
    # debugger
    tea = Tea.new(tea_params)
    if tea.save # remember no bang
---
INSERT INTO "teas" ("flavor", "price", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["flavor", "test"], ["price", 99.0], ["description", nil], ["created_at", "2022-08-25 18:59:44.615498"], ["updated_at", "2022-08-25 18:59:44.615498"]]