lectures/W11D4-middleware/TeaTime/app/controllers/api/teas_controller.rb

  def index
    teas = Tea.all
---
SELECT "teas".* FROM "teas"

  def create
    tea = Tea.new(tea_params)
    if tea.save
---
INSERT INTO "teas" ("flavor", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["flavor", "pink"], ["amount", 7.2], ["created_at", "2021-09-16 18:34:13.284225"], ["updated_at", "2021-09-16 18:34:13.284225"]]