lectures/w11d4-middleware/TeaTime/app/controllers/api/teas_controller.rb

SELECT "teas".* FROM "teas"
---
    def index
        teas = Tea.all

INSERT INTO "teas" ("flavor", "cost", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["flavor", "Passion"], ["cost", 99.0], ["description", "worth it"], ["created_at", "2021-11-11 19:46:42.533022"], ["updated_at", "2021-11-11 19:46:42.533022"]]
---
    def create
        tea = Tea.new(tea_params)
        if tea.save