lectures/w11d4-middleware/demo/TeaTime/app/controllers/api/teas_controller.rb

    def index
        teas = Tea.all
---
SELECT "teas".* FROM "teas"

    def create
        tea = Tea.new(tea_params)
        if tea.save
---
INSERT INTO "teas" ("flavor", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["flavor", "grey"], ["price", 14.32], ["created_at", "2022-05-05 18:05:53.145906"], ["updated_at", "2022-05-05 18:05:53.145906"]]