lectures/w7d1-user-auth/DogeBird/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def show

        incoming_id = params[:id]
        @user = User.find_by(id: incoming_id)

INSERT INTO "users" ("username", "email", "created_at", "updated_at", "age", "favorite_coin") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", "goofy"], ["email", "thedisneydog@disney.com"], ["created_at", "2022-07-22 18:03:01.669365"], ["updated_at", "2022-07-22 18:03:01.669365"], ["age", 89], ["favorite_coin", "Doge"]]
---
    def create
        # debugger
        @user = User.new(user_params)
        if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "favorite_coin" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-07-22 18:50:41.686126"], ["favorite_coin", "Dogee"], ["id", 17]]
---
    def update
        @user = User.find_by(id: params[:id])
        if @user.update(user_params)