lectures/w12d1-jbuilder/demo/app/views/api/teas/show.json.jbuilder

SELECT "transactions".* FROM "transactions" WHERE "transactions"."tea_id" = $1  [["tea_id", 1]]
---
json.transactions do
  @tea.transactions.each do |transaction|